Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: # but do track lib.a, even though you're ignoring .a files above !lib.a
cs: # ale sleduj lib.a i přes to, že se výše uvedeným pravidlem mají .a ignorovat !lib.a

source: # ignore all .pdf files in the doc/ directory doc/**/*.pdf ----
cs: # ignoruj všechny .pdf soubory v adresáři doc/ doc/**/*.pdf ----

source: # ignore all files in the build/ directory build/
cs: # ignoruj všechny soubory v adresáři build/ build/

source: # ignore doc/notes.txt, but not doc/server/arch.txt doc/*.txt
cs: # ignoruje doc/notes.txt, ale ne doc/server/arch.txt doc/*.txt

source: # only ignore the TODO file in the current directory, not subdir/TODO /TODO
cs: # soubor TODO ignoruj jen tomto adresáři, ale neignoruj subdir/TODO /TODO

source: (((CVS)))(((Subversion)))(((Perforce))) For many years, this has been the standard for version control.
cs: Tento koncept správy verzí byl po dlouhá léta považován za standard.

source: (((Linux, installing))) If you want to install the basic Git tools on Linux via a binary installer, you can generally do so through the basic package-management tool that comes with your distribution.
cs: (((Linux, instalace))) Chcete-li nainstalovat Git v Linuxu pomocí binárního instalátoru, většinou tak můžete učinit pomocí základního nástroje pro správu balíčků, který je součástí vaší distribuce.

source: (((Mac, installing))) There are several ways to install Git on a Mac.
cs: (((Mac, instalace))) Na počítačích Mac můžeme Git instalovat několika způsoby.

source: (((aliases))) Before we finish this chapter on basic Git, there's just one little tip that can make your Git experience simpler, easier, and more familiar: aliases.
cs: (((aliases))) Než ukončíme tuto kapitolu věnovanou základům práce s Gitem, máme tu ještě jeden malý tip, který může učinit vaši práci s Gitem jednodušší, snazší a osobnější: aliasy.

source: (((branches))) Nearly every VCS has some form of branching support.
cs: (((branches))) Nějakou formu větvení podporují téměř všechny systémy pro správu verzí.

source: (((branches, basic workflow))) First, let's say you're working on your project and have a couple of commits already.
cs: (((větve, základní postup))) Řekněme, že pracujete na projektu a už jste vytvořili několik revizí.

source: (((branches, creating))) What happens if you create a new branch?
cs: (((větve, vytváření))) Co se stane, když vytvoříte novou větev?

source: (((branches, deleting remote))) Suppose you're done with a remote branch – say you and your collaborators are finished with a feature and have merged it into your remote's `master` branch (or whatever branch your stable codeline is in).
cs: (((větve, mazání vzdálených))) Dejme tomu, že máte vzdálenou větev hotovou -- řekněme, že jste se spolupracovníky dokončili nějakou funkčnost a začlenili ji do větve `master` vašeho vzdáleného repozitáře (nebo do jiné větve, do které umísťujete stabilní kód).

source: (((branches, long-running))) Because Git uses a simple three-way merge, merging from one branch into another multiple times over a long period is generally easy to do.
cs: (((větve, dlouhotrvající))) Protože Git používá jednoduché třícestné slučování, je opakované začleňování jedné větve do druhé velmi snadné i v průběhu delšího času.

source: (((branches, managing))) Now that you've created, merged, and deleted some branches, let's look at some branch-management tools that will come in handy when you begin using branches all the time.
cs: Když už jste vytvořili, sloučili a odstranili nějaké větve, podívejme se na pár nástrojů pro správu větví, které se vám při soustavném používání větví budou hodit.

source: (((branches, merging)))(((merging))) Suppose you've decided that your issue #53 work is complete and ready to be merged into your `master` branch.
cs: (((větve, slučování)))(((slučování))) Předpokládejme, že jste se rozhodli, že práce na problému #53 je hotová a lze ji začlenit do větve `master`.

source: (((branches, remote)))(((references, remote))) Remote references are references (pointers) in your remote repositories, including branches, tags, and so on.
cs: (((větve, vzdálené)))(((reference, vzdálené))) Vzdálené reference jsou odkazy (ukazatelé) ve vašich vzdálených repozitářích a zahrnují větve, značky (tag) a další.

source: (((branches, switching))) To switch to an existing branch, you run the `git checkout` command.(((git commands, checkout))) Let's switch to the new `testing` branch:
cs: (((větve, přepínání))) Chcete-li přepnout na existující větev, spusťte příkaz `git checkout`.(((git příkazy, checkout))) Přepněme se na novou větev `testing`:

source: (((branches, topic))) Topic branches, however, are useful in projects of any size.
cs: (((větve, tématické))) Naproti tomu tématické větve se hodí v projektech jakékoli velikosti.

source: (((branches, tracking)))(((branches, upstream))) Checking out a local branch from a remote-tracking branch automatically creates what is called a ``tracking branch'' (or sometimes an ``upstream branch'').
cs: (((větve, sledující)))(((větve, upstream))) Přepnutím (checkout) na lokální větev při odvození od vzdáleně sledované větve automaticky vzniká to, čemu se říká „sledující větev“ (nebo někdy „upstream větev“).

source: (((contributing))) The main difficulty with describing how to contribute to a project is that there are a huge number of variations on how it's done.
cs: (((přispívání))) Hlavní potíž při popisu způsobu přispívání do projektu spočívá v tom, že existuje obrovské množství variací, jak se to dá udělat.

source: (((contributing, private managed team))) In this next scenario, you'll look at contributor roles in a larger private group.
cs: (((přispívání, soukromý řízený tým))) V následujícím scénáři se podíváme na role přispěvatelů ve větší soukromé skupině.

source: (((contributing, private small team))) The simplest setup you're likely to encounter is a private project with one or two other developers.
cs: (((přispívání, malý soukromý tým))) Nejjednodušší situaci, s kterou se asi setkáte, je soukromý projekt s jedním nebo pár dalšími vývojáři.

source: (((contributing, public large project))) Many projects have established procedures for accepting patches – you'll need to check the specific rules for each project, because they will differ.
cs: Mnoho projektů si vytvořilo vlastní procedury pro přijímání záplat. Konkrétní pravidla si u každého projektu budete muset zjistit, protože budou odlišná.

source: (((contributing, public small project))) Contributing to public projects is a bit different.
cs: (((přispívání, veřejný malý projekt))) Přispívání do veřejných projektů je trochu odlišné.

source: (((distributed git))) Now that you have a remote Git repository set up as a point for all the developers to share their code, and you're familiar with basic Git commands in a local workflow, you'll look at how to utilize some of the distributed workflows that Git affords you.
cs: (((distribuovaný git))) Máte vytvořen vzdálený gitový repozitář, který je nastaven tak, aby mohli všichni vývojáři sdílet svůj zdrojový kód, a znáte základní příkazy Gitu pro práci v lokálním prostředí. Nastal čas, abychom se podívali na využití některých distribuovaných pracovních postupů, které vám Git nabízí.

source: (((files, moving))) Unlike many other VCS systems, Git doesn't explicitly track file movement.
cs: (((soubory, přesouvání))) Na rozdíl od ostatních systémů pro správu verzí, Git nesleduje přesouvání souborů přímo.

source: (((files, removing))) To remove a file from Git, you have to remove it from your tracked files (more accurately, remove it from your staging area) and then commit.
cs: (((soubory, odstranění))) Chcete-li soubor z Gitu odstranit, musíte ho odstranit ze sledovaných souborů (přesněji řečeno, musíte ho odstranit z oblasti připravených změn) a poté zapsat revizi.

source: (((forking))) This is a very common workflow with hub-based tools like GitHub or GitLab, where it's easy to fork a project and push your changes into your fork for everyone to see.
cs: (((odštěpení))) Tento pracovní postup je velmi běžný, pokud se pracuje centralizačními nástroji{empty}footnote:[hub-based tools] jako je GitHub nebo GitLab. Projekt se zde dá snadno odštěpit a změny se pak odesílají do vlastní, odštěpené části, kde se na ně může každý podívat.

source: (((git commands, diff, check))) First, you don't want to submit any whitespace errors.
cs: (((git příkazy, diff, check))) Především nechcete odesílat chybně použité prázdné znaky (whitespace).

source: (((git commands, merge, squash))) [source,console] ---- $ git checkout -b featureBv2 origin/master $ git merge --squash featureB # (change implementation) $ git commit $ git push myfork featureBv2 ----
cs: (((git commands, merge, squash))) [source,console] ---- $ git checkout -b featureBv2 origin/master $ git merge --squash featureB # (změníte implementaci) $ git commit $ git push myfork featureBv2 ----

source: (((git commands, request-pull))) When your work has been pushed up to your fork, you need to notify the maintainer.
cs: (((git příkazy, request-pull))) Pokud jste práci odeslali do odštěpeného repozitáře, musíte to správci oznámit.

source: (((merging, conflicts))) Occasionally, this process doesn't go smoothly.
cs: (((slučování, konflikty))) Občas se stane, že tento proces neproběhne hladce.

source: (((protocols, local))) The most basic is the _Local protocol_, in which the remote repository is in another directory on disk.
cs: Nejzákladnějším z nich je _lokální protokol_, kdy je vzdálený repozitář uložen v jiném adresáři na disku.

source: (((pulling))) While the `git fetch` command will fetch down all the changes on the server that you don't have yet, it will not modify your working directory at all.
cs: (((pulling))) Příkaz `git fetch` sice vyzvedne všechny změny ze serveru, které ještě nemáte, ale nijak nezmění obsah vašeho pracovního adresáře.

source: (((pushing))) When you want to share a branch with the world, you need to push it up to a remote that you have write access to.
cs: (((odesílání))) Chcete-li svou větev sdílet s okolním světem, musíte ji odeslat (push) do vzdáleného repozitáře, k němuž máte oprávnění pro zápis.

source: (((rebasing))) In Git, there are two main ways to integrate changes from one branch into another: the `merge` and the `rebase`.
cs: (((přeskládání))) V Gitu existují dva základní způsoby, jak integrovat změny z jedné větve do druhé: `merge` (sloučení, začlenění) a `rebase` (přeskládání).

source: (((rebasing, perils of))) Ahh, but the bliss of rebasing isn't without its drawbacks, which can be summed up in a single line:
cs: (((přeskládání, rizika))) Ale slastné přeskládání má i stinné stránky, které se dají shrnout do jednoho řádku:

source: (((rebasing, vs. merging)))(((merging, vs. rebasing))) Now that you've seen rebasing and merging in action, you may be wondering which one is better.
cs: (((přeskládání, vs. slučování)))(((slučování, vs. přeskládání))) Když jste teď přeskládání a slučování viděli v akci, možná by vás zajímalo, které z nich je lepší.

source: (((serving repositories))) At this point, you should be able to do most of the day-to-day tasks for which you'll be using Git.
cs: (((obsluha repozitářů))) V tomto okamžiku už byste měli zvládat většinu každodenních úkonů, pro které budete Git používat.

source: (((staging area, skipping))) Although it can be amazingly useful for crafting commits exactly how you want them, the staging area is sometimes a bit more complex than you need in your workflow.
cs: (((oblast připravených změn, přeskočení))) Oblast připravených změn může být úžasně užitečným nástrojem pro vytváření chtěné posloupnosti revizí, ale při určitém způsobu práce někdy představuje zbytečnou komplikaci.

source: (((tags))) Like most VCSs, Git has the ability to tag specific points in history as being important.
cs: (((značky))) Stejně jako většina systémů pro správu verzí nabízí i Git možnost označovat v historii určitá místa, jež považujete za důležitá.

source: (((tags, annotated))) Creating an annotated tag in Git is simple.
cs: (((značky, anotované))) Anotovaná značka se v Gitu vytváří jednoduše.

source: (((tags, lightweight))) Another way to tag commits is with a lightweight tag.
cs: (((značky, prosté))) Další možností, jak označit revizi, je prostá značka.

source: (((version control))) What is "version control", and why should you care?
cs: (((správa verzí))) Co je to správa verzí a proč by vás měla zajímat?

source: (((version control,centralized))) The next major issue that people encounter is that they need to collaborate with developers on other systems.
cs: (((správa verzí, centralizovaná))) Dalším velkým problémem, s nímž se uživatelé potýkají, je potřeba spolupráce s vývojáři pracujícími na jiných počítačích.

source: (((version control,distributed))) This is where Distributed Version Control Systems (DVCSs) step in.
cs: V tomto místě přicházejí ke slovu distribuované systémy správy verzí (DVCS z anglického Distributed Version Control System).

source: (((version control,local))) Many people's version-control method of choice is to copy files into another directory (perhaps a time-stamped directory, if they're clever).
cs: (((správa verzí, lokální))) Mnoho uživatelů realizuje správu verzí tak, že zkopírují soubory do jiného adresáře (pokud jsou chytří, dají adresáři jméno podle data a času).

source: (((workflows))) Unlike Centralized Version Control Systems (CVCSs), the distributed nature of Git allows you to be far more flexible in how developers collaborate on projects.
cs: (((pracovní postupy))) Na rozdíl od centralizovaných systémů pro správu verzí, distribuovaný charakter systému Git umožňuje vývojářům mnohem větší pružnost ve způsobech spolupráce na projektech.

source: (((workflows, centralized))) In centralized systems, there is generally a single collaboration model–the centralized workflow.
cs: (((pracovní postupy, centralizovaný))) V centralizovaných systémech je většinou možný pouze jediný model, tzv. centralizovaný pracovní postup.

source: (((workflows, dictator and lieutenants))) This is a variant of a multiple-repository workflow.
cs: (((pracovní postupy, diktátor a poručíci))) Jedná se o variantu pracovního postupu s více repozitáři.

source: (((workflows, integration manager))) Because Git allows you to have multiple remote repositories, it's possible to have a workflow where each developer has write access to their own public repository and read access to everyone else's.
cs: (((pracovní postupy, integrační manažer))) Protože Git umožňuje práci s více vzdálenými repozitáři, lze využít pracovní postup, kdy má každý vývojář přiděleno právo zápisu do svého vlastního veřejného repozitáře a oprávnění pro čtení k repozitářům všech ostatních.

source: (For an even more explicit reminder of what you've modified, you can pass the `-v` option to `git commit`.
cs: (Chcete-li si ještě podrobněji připomenout, co jste měnili, můžete k příkazu `git commit` přidat parametr `-v`.

source: (Note that if you want to specify both author and grep options, you have to add `--all-match` or the command will match commits with either.)
cs: (Pokud chcete předepsat současnou platnost voleb `--author` a `--grep`, musíte přidat `--all-match`, jinak příkaz propustí revize vyhovující i jedné z nich.)

source: (See <<_git_internals>> for more information about exactly what files are contained in the `.git` directory you just created.)(((git commands, init)))
cs: (Více informací o tom, jaké soubory obsahuje právě vytvořený adresář `.git`, naleznete v kapitole <<_git_internals>>.)(((git příkazy, init)))

source: (The protocol messages have been replaced with `...` in these examples to shorten them somewhat.)
cs: (V následujících příkladech byly zprávy protokolů nahrazeny třemi tečkami, abych je trochu zkrátil.)

source: (This is set by your shell's `$EDITOR` environment variable – usually vim or emacs, although you can configure it with whatever you want using the `git config --global core.editor` command as you saw in <<_getting_started>>).(((editor, changing default)))(((git commands, config)))
cs: (Ten je nastaven proměnnou prostředí `$EDITOR` vašeho shellu. Obvykle je to vim nebo emacs, ale příkazem `git config --global core.editor` můžete nastavit libovolný jiný -- jak jsme viděli v kapitole <<_getting_started>>).(((editor, změna výchozího)))(((git příkazy, config)))

source: (We'll go over what branches are and how to use them in much more detail in <<_git_branching>>.)
cs: (Podrobněji se budeme větvím a jejich použití věnovat v kapitole <<_git_branching>>.)

source: * Blank lines or lines starting with `#` are ignored.
cs: * Prázdné řádky nebo řádky začínající znakem `#` budou ignorovány.

source: * Speed * Simple design * Strong support for non-linear development (thousands of parallel branches) * Fully distributed * Able to handle large projects like the Linux kernel efficiently (speed and data size)
cs: * Rychlost, * jednoduchý návrh, * silná podpora nelineárního vývoje (tisíce paralelních větví), * plně distribuovaný, * schopnost efektivně spravovat velké projekty, jako je linuxové jádro (rychlost a objem dat).

source: * Standard glob patterns work.
cs: * Používají se standardní masky souborů (glob patterns).

source: * You can end patterns with a forward slash (`/`) to specify a directory.
cs: * Masku můžete ukončit lomítkem (`/`) a tím vyjádříte, že jde o adresář.

source: * You can negate a pattern by starting it with an exclamation point (`!`).
cs: * Masku můžete negovat tím, že na začátku použijete vykřičník (`!`).

source: * You can start patterns with a forward slash (`/`) to avoid recursivity.
cs: * Masku můžete zahájit lomítkem (`/`) a tím potlačíte rekurzivitu.

source: * Determine what work is unique to our branch (C2, C3, C4, C6, C7) * Determine which are not merge commits (C2, C3, C4) * Determine which have not been rewritten into the target branch (just C2 and C3, since C4 is the same patch as C4') * Apply those commits to the top of `teamone/master`
cs: * Určí, jaká práce je pro naši větev jedinečná (C2, C3, C4, C6, C7). * Určí, co z toho nejsou body sloučení (C2, C3, C4). * Určí, které z nich nebyly do cílové větve zapsány znovu (jsou to jen C2 a C3, protože C4 představuje stejnou záplatu jako C4'). * Na `teamone/master` aplikuje jen určené revize.

source: *Do not rebase commits that exist outside your repository.*
cs: *Neprovádějte přeskládání pro revize, které existují mimo váš repozitář.*

source: - Bullet points are okay, too
cs: - Můžete používat i odrážky.

source: - Typically a hyphen or asterisk is used for the bullet,
cs: - Pro odrážku se typicky používá pomlčka nebo hvězdička,

source: .A branch and its commit history image::images/branch-and-history.png[A branch and its commit history.]
cs: .Větev a historie jejích objektů revize image::images/branch-and-history.png[Větev a historie jejích objektů revize.]

source: .A commit and its tree image::images/commit-and-tree.png[A commit and its tree.]
cs: .Objekt revize a jeho strom image::images/commit-and-tree.png[Objekt revize a jeho strom.]

source: .A linear view of progressive-stability branching image::images/lr-branches-1.png[A linear view of progressive-stability branching.]
cs: .Lineární pohled na větvení podle stupně stability image::images/lr-branches-1.png[Lineární pohled na větvení podle stupně stability.]

source: .A merge commit image::images/basic-merging-2.png[A merge commit.]
cs: .Bod sloučení image::images/basic-merging-2.png[Bod sloučení.]

source: .A simple commit history image::images/basic-branching-1.png[A simple commit history.]
cs: .Jednoduchá historie revizí image::images/basic-branching-1.png[Jednoduchá historie revizí.]

source: .Adding another server as a remote image::images/remote-branches-4.png[Adding another server as a remote.]
cs: .Přidání dalšího serveru v roli vzdáleného repozitáře image::images/remote-branches-4.png[Přidání dalšího serveru v roli vzdáleného repozitáře.]

source: .Basic sequence of this managed-team workflow.
cs: .Základní posloupnost událostí pracovního postupu řízeného týmu.

source: .Centralized version control.
cs: .Centralizovaná správa verzí.

source: .Centralized workflow.
cs: .Centralizovaný pracovní postup.

source: .Clone a repository, and base some work on it image::images/perils-of-rebasing-1.png["Clone a repository, and base some work on it."]
cs: .Naklonování repozitáře a provedení změn image::images/perils-of-rebasing-1.png[Naklonování repozitáře a provedení změn.]

source: .Commit history after `featureBv2` work.
cs: .Historie revizí po práci ve větvi `featureBv2`.

source: .Commits and their parents image::images/commits-and-parents.png[Commits and their parents.]
cs: .Objekty revize a jejich rodiče image::images/commits-and-parents.png[Objekty revize a jejich rodiče.]

source: .Creating a new branch pointer image::images/basic-branching-2.png[Creating a new branch pointer.]
cs: .Vytvoření nového ukazatele větve image::images/basic-branching-2.png[Vytvoření nového ukazatele větve.]

source: .Distributed version control.
cs: .Distribuovaný systém pro správu verzí.

source: .Fast-forwarding the master branch image::images/basic-rebase-4.png[Fast-forwarding the master branch.]
cs: .Posunutí větve `master` rychle vpřed image::images/basic-rebase-4.png[Posunutí větve `master` rychle vpřed.]

source: .Fetch more commits, and merge them into your work image::images/perils-of-rebasing-2.png["Fetch more commits, and merge them into your work."]
cs: .Vyzvednutí (fetch) bodů zápisu a jejich začlenění (merge) do vaší práce image::images/perils-of-rebasing-2.png[Vyzvednutí (fetch) bodů zápisu a jejich začlenění (merge) do vaší práce.]

source: .General sequence of events for a simple multiple-developer Git workflow.
cs: .Obecná posloupnost událostí pro jednoduchý pracovní postup s více vývojáři.

source: .Git OS X Installer.
cs: .Instalátor Gitu pro OS X.

source: .HEAD moves when you checkout image::images/checkout-master.png[HEAD moves when you checkout.]
cs: .Při checkout se HEAD přesune image::images/checkout-master.png[Při checkout se HEAD přesune.]

source: .HEAD pointing to a branch image::images/head-to-master.png[HEAD pointing to a branch.]
cs: .HEAD ukazující na větev image::images/head-to-master.png[HEAD ukazující na větev.]

source: .HEAD points to the current branch image::images/head-to-testing.png[HEAD points to the current branch.]
cs: .HEAD ukazuje na aktuální větev image::images/head-to-testing.png[HEAD ukazuje na aktuální větev.]

source: .History after merging `dumbidea` and `iss91v2` image::images/topic-branches-2.png[History after merging `dumbidea` and `iss91v2`.]
cs: .Historie po začlenění `dumbidea` a `iss91v2` image::images/topic-branches-2.png[Historie po začlenění `dumbidea` a `iss91v2`.]

source: .Hotfix branch based on `master` image::images/basic-branching-4.png[Hotfix branch based on `master`.]
cs: .Větev pro opravu je odvozená od `master` image::images/basic-branching-4.png[Větev pro opravu je odvozená od `master`.]

source: .Initial commit history with `featureB` work.
cs: .Počáteční historie revizí s prací na `featureB`.

source: .Jessica's history after committing on a feature branch.
cs: .Jessičina historie po zapsání revizí do větve s úkolem.

source: .Jessica's history after fetching John's changes.
cs: .Historie Jessicy po vyzvednutí Johnových změn.

source: .Jessica's history after merging John's changes.
cs: .Jessičina historie po začlenění Johnových změn.

source: .Jessica's history after merging both her topic branches.
cs: .Historie Jessicy po začlenění obou jejích tématických větví.

source: .Jessica's history after pushing all changes back to the server.
cs: .Jessičina historie po odeslání všech změn zpět na server.

source: .Jessica's initial commit history.
cs: .Jessičina výchozí historie revizí.
